// Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).

// Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата. Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.

// НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

#include <stdio.h>
#include <string.h>
#define MAX 100


int main(){
    int str[100];
    int n, ind;
    int vkupno = 0;
    scanf("%d", &n);
    for (int i = 0 ; i<n; i++){
        scanf("%d", &str[i]);
    }
    
    scanf("%d", &ind);
    
    for (ind ; ind<n; ind++){
        vkupno = vkupno + str[ind];
    }    
    
    printf("%d", vkupno);
    
    return 0;
}