// Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони (N не е поголемо од 50). Програмата треба да ја трансформира вчитаната матрица во нова матрица B, така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица, односно од матрица со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n; scanf("%d", &n); int A[n*2][n*2];

    for(int i=0; i<n; i++)
    {
        for(int j=0; j<n*2; j++)
        {
            if(j>n-1){ scanf("%d", &A[i+n][j-n]); }
            else { scanf("%d", &A[i][j]); }
        }
    }

    for(int i=0; i<n*2; i++)
    { for(int j=0; j<n; j++){ printf("%d ", A[i][j]); }
        printf("\n"); } return 0;
}